{
  "site": {
    "title": "Imai Laboratory",
    "description": "Interactive Artificial Intelligence Laboratory, Department of Information and Computer Science, Keio University"
  },
  "navigation": {
    "home": "Home",
    "research": {
      "main": "Research",
      "theme": "Research Themes",
      "proj": "Research Projects"
    },
    "member": "Members",
    "publication": {
      "main": "Publications",
      "journal": "Journal",
      "international": "International Conference",
      "domestic": "Domestic Conference(Japan)"
    },
    "activity": {
      "main": "Activities",
      "award": "Awards",
      "media": "Media",
      "talk": "Talks"
    },
    "access": "Access",
    "links": "Links",
    "for_collaborations": "For Collaborations and Companies"
  },
  "external": {
    "b3": "For B3",
    "twitter": "Imai Lab Twitter"
  },
  "members": {
    "past": {
      "head": "Past Members"
    },
    "grade": {
      "doctor": "Doctor",
      "master": "Master",
      "bachelor": "Bachelor"
    }
  },
  "activities": {
    "award": "Awards",
    "media": "Media Coverage",
    "talk": "Talks & Presentations"
  },
  "publications": {
    "journal": "Journal Papers",
    "international": "International Conference Papers",
    "domestic": "Domestic Conference Papers"
  },
  "home": {
    "title": "INTERACTIVE ARTIFICIAL INTELLIGENCE LABORATORY",
    "message": "We are developing interactive AI algorithms and systems that augment the interaction between people and information systems and the communication between people.",
    "keywords": "Keywords"
  },
  "research": {
    "projects": {
      "isc": {
        "title": "A Robot that Recommends Products with Few Samples Interactive-SmartClerk",
        "desc": "When building a machine learning model, a large number of samples is typically required. Even when fine-tuning a model to match an individual's preferences, a considerable amount of preference data is necessary. On the other hand, a store clerk can recommend products by simply asking about 2 or 3 preferences. This research utilizes a mathematical model revealed through cognitive science experiments that explain how humans infer others' preferences. By asking about preferences for just four dresses, it can recommend a preferred dress."
      },
      "scains": {
        "title": "Missed Conversation Support System",
        "desc1": "In online meetings such as Zoom, it's easy to miss what others are saying when you're distracted by something else. Many people have experienced the frustration of being asked for their opinion when they weren't paying attention. We developed an algorithm that identifies important missed statements (which we call SCAINs) from the conversation. Additionally, we created the SCAINs Presenter, which presents these important missed statements to help people navigate through situations where they missed parts of the conversation. With the practical application of this research, individuals will be able to participate in multiple meetings or handle multiple tasks more efficiently.",
        "desc2": "In the video at left, you and Person A are having a conversation about a picture next to you, while Person B is not paying attention (in this video, Person A and Person B are using GPT-4, and you are providing human input). When important parts of the conversation between you and Person A arise that would cause a loss of meaning if missed, the corresponding sections are highlighted in yellow and red (the colors are used to make the algorithm's judgments easier to understand). In the video, we verify what happens if Person B misses these key sections by directing the conversation to them. You'll notice that Person B, who missed the colored sections, starts saying things that are off-topic."
      },
      "closer": {
        "title": "Automatic English Cloze Test Generation System CLOZER",
        "desc": "Q. Fill in the blank with the correct word: \"If you want to go to Keio University, you should ____ hard.\"This type of fill-in-the-blank question is called a cloze test. In this research, we define a good cloze test as one where no other word fits the context besides the correct answer. We developed an algorithm called CLOZER that automatically generates such questions. CLOZER uses BERT, a large-scale natural language model, to simulate human answer tendencies and calculates a Gap Score based on the Gini coefficient to generate questions. This research aims to determine whether machine learning models can simulate human thought processes when solving problems and whether they can create good questions."
      },
      "relbot": {
        "title": "A Robot That Engages in Conversation While Judging Relationships",
        "desc": "People engage in conversations while considering whether they agree or disagree with others' opinions. Sometimes, this leads to conflicts during discussions. This research utilizes a large-scale language model to infer the relationships between participants and applies Heider's balance theory, which describes the dynamics of likes and dislikes among three people, to simulate conversations where participants either become allies or experience discord. Let's take a look at a conversation between Keio-fan Pepper-kun, Waseda-fan Pepper-chan, and a human."
      },
      "travot": {
        "title": "Conversation Robot System for Travel Memoir Generation",
        "desc": "We aim to create a system that generates travel diaries through dialogue with a robot. While image captioning technology can now provide descriptive text about photos, it cannot capture the stories or memories behind the moment when the photo was taken or the experiences associated with it. To create a travel diary, it is necessary to gather information directly from the person who experienced the trip. In this research, we developed a robot that engages in conversation about photos taken during a trip. The system then uses the information gathered through this conversation to generate a travel diary filled with personal memories."
      }
    },
    "themes": {
      "ai": {
        "title": "The research of contextual language understanding",
        "desc": "The meaning of a word depends on the context. The context consists of words that have a fixed meaning. Since the context and the senses depend on each other, a method of the simultaneous estimation is significant to grasp the flow of a dialogue. In the theme, we are developing a language comprehension algorithm that progresses in time to gradually understand what the other person is saying in a conversation while allowing misunderstanding each other."
      },
      "si": {
        "title": "The research of situated interaction",
        "desc": "Situated expressions are related to things and events in the environment around them and exclude obvious information from themselves. People select the relevant environmental stuff along with the progress of the dialogue. In this theme, we are investigating a method for determining important information for a conversation from image information and sensor information."
      },
      "ad": {
        "title": "Augmented Dialogue",
        "desc": "The difficulty in human-human communication is related to the uncertainty of whether the other person understands the meaning of what you want to say or is looking at the material you want to show. In this theme, we develop an Augmented Dialogue that supports dialogue between people by guessing the missing information that occurs in the interaction by using an artificial intelligence system."
      },
      "iu": {
        "title": "Interactive understanding others with small samples",
        "desc": "Humans are able to acquire the model of the others with small numbers of interactions, while the machine learning algorithm requires a certain amount of data. The theme develops an AI system in the scene of understanding others in interaction by comparing the tendency of human interlocutors with the machine learning algorithm."
      },
      "ui": {
        "title": "User Interface for Mutual Adaptation",
        "desc": "There are a lot of autonomous machines that accept humans' control, such as computer applications, computer games, teleoperated robots, and autonomous vehicles. The control interface for the devices provides a pre-designed method, while users have their preferred style of control. The theme investigates a control environment to support mutual adaptation between users and machines by using a technique of machine learning.",
        "desc2": "Researching a wearable avatar named TEROOS. TEROOS is mounted on a person's shoulder and enables the wearer and the user controlling it to share vision remotely. Furthermore, this avatar has an anthropomorphic face, allowing the user controlling it to communicate with people co-located with the wearer, thereby enhancing joint activities between humans and robots."
      },
      "ag": {
        "title": "My Great Agent (ITACO System)",
        "desc": "We study an autonomous agent to support the user's daily life via interaction. The agent is expected to migrate different types of home appliances to help the user, which is difficult for the robot, which has a physical embodiment. We try to propose the agent-based user interface to integrate the services of living environments and home appliances."
      }
    },
    "keywords": {
      "ca": "Cognitive Adaption",
      "as": "Augmented Society",
      "cn": "Cognitive Neural Network"
    }
  },
  "access": {
    "location": {
      "title": "Location",
      "content": "Imai Laboratory is located in Yagami Campus."
    },
    "address": {
      "title": "Address",
      "content": "Imai Laboratory, Dept. of Information & Computer Science,\nFaculty of Science & Technology, Keio University\n3-14-1 Hiyoshi, Kohoku-ku, Yokohama-shi, Kanagawa-ken 223-8522 Japan"
    },
    "rooms": {
      "title": "Rooms",
      "content": "Professor Michita Imai's Room: 26-208B\nStudents' Room: 26-203\n"
    },
    "contact": {
      "title": "Contact",
      "content": "TEL: +81-45-566-1515 (Professor's Room)\nTEL: +81-45-566-1749 (Students' Room)"
    },
    "map": {
      "title": "Google Map",
      "description": "Find the location of Keio University Yagami Campus"
    },
    "accessmap_link": "Yagami Campus Map (Japanese)"
  },
  "for_collaborations": {
    "about": {
      "title": "At the Imai Laboratory of Keio University, we actively engage in academic consulting to support the scholarly activities of companies and collaborate on joint research projects to address the challenges faced by businesses."
    },
    "examples": {
      "title": "Examples of Collaborative Research",
      "desc": "Development of service systems using computer systems, CG agents, and robots that can communicate with humans (via conversation).\nSystem design for emotionally expressive CG characters and robots.\nDevelopment of value-added services for online meeting systems.\nSystem development utilizing large-scale language models.\nAnalysis of communication (conversation) data."
    },
    "contact": {
      "title": "Contact",
      "desc": "Professor Michita Imai\nFaculty of Science and Technology, Keio University\n\nEmail: michita@ailab.ics.keio.ac.jp"
    }
  },
  "footer": {
    "quick_links": "Quick Links",
    "contact": "Contact",
    "copyright": "Imai Laboratory, Department of Information and Computer Science, Keio University"
  }
}
