{
  "site": {
    "title": "今井研究室",
    "description": "慶應義塾大学理工学部情報工学科 インタラクティブ人工知能研究室"
  },
  "navigation": {
    "home": "ホーム",
    "research": "研究",
    "research_theme": "研究分野",
    "research_proj": "研究プロジェクト",
    "member": "メンバー",
    "publication": "研究業績",
    "publication_journal": "ジャーナル",
    "publication_international": "国際会議",
    "publication_domestic": "国内会議(日本)",
    "activity": "活動報告",
    "activity_award": "受賞",
    "activity_media": "メディア",
    "activity_talk": "登壇",
    "access": "アクセス",
    "links": "外部リンク",
    "for_collaborations": "共同研究・企業の方へ"
  },
  "external": {
    "b3": "B3向け情報",
    "twitter": "今井研究室Twitter"
  },
  "members": {
    "members_head": "研究室メンバー",
    "members_past_head": "過去のメンバー",
    "members_past_grade_doctor": "博士",
    "members_past_grade_master": "修士",
    "members_past_grade_bachelor": "学士"
  },
  "activities": {
    "award": "受賞",
    "media": "メディア掲載",
    "talk": "講演・発表"
  },
  "publications": {
    "journal": "ジャーナル論文",
    "international": "国際会議論文",
    "domestic": "国内会議論文"
  },
  "home": {
    "title": "INTERACTIVE ARTIFICIAL INTELLIGENCE LABORATORY",
    "message": "人と情報システムのインタラクション・人と人のコミュニケーションを拡張するインタラクティブAIについて研究しています。",
    "keywords": "キーワード"
  },
  "research": {
    "projects": {
      "isc": {
        "title": "少ないサンプルで商品を推薦するロボット Interactive-SmartClerk",
        "desc": "機械学習でモデルをつくるときには大量のサンプルが必要です。ある人の好みのモデルをファインチューニングするにしても、それなりの好みのサンプルが必要です。一方で、店の店員は2,3好みを聞くことで商品を推薦できたりします。この研究では、人が相手の好みをどのように推定するのか、認知科学実験をおこない明らかになった数理モデルを利用しています。4着のドレスの好みを聞くだけで、好みのドレスを推薦することができます。"
      },
      "scains": {
        "title": "聞き逃し支援システム",
        "desc1": "zoomなどのオンライン会議では、他のことをしていてつい他の人の話を聞き逃してしまうことがあります。話を聞いていない時に、意見を求められて困った経験がある人もいると思います。このような聞き逃した発言の中から重要な発言（SCAINsと呼んでいます）を見つけるアルゴリズを作りました。また、聞き逃した人にSCAINsを提示して、聞き逃し場面を乗り切るSCAINs Presenterを作りました。この研究が実用化されることで、一人の人が複数の会議に参加できたり、複数の仕事を効率良くこなすことができるようになります。",
        "desc2": "左のビデオでは、Aさんとあなたが横にある絵について会話をしていて、Bさんが話を聞いていない場面です(このビデオではAさんとBさんは、gpt4を用いています。あなたは、人間の入力です)。Aさんとあなたの会話の中で聞き逃すと意味が発生する会話が生じると、該当箇所が黄色と赤色で表示されます（アルゴリズムの判定をわかりやすくするために色をつけてます）。ビデオの中では、この場面で、該当箇所を聞き逃すとどうなるかを、Bさんに話を振ることで確かめています。色のついた場所を聞き逃しているBさんが検討違いのことを言い出すのがわかると思います。"
      },
      "closer": {
        "title": "英語穴埋め問題の自動生成システム CLOZER",
        "desc": "Q. 以下の穴埋め問題に入る単語を答えよ。\"If you want to go to Keio University, you should ____ hard.\" このような自由記述の穴埋め問題をcloze testと言います。この研究では、正解の単語意外文脈的に入らない問題を良いcloze testとして、自動で問題を生成するアルゴリズムCLOZERを開発しました。CLOZERでは、大規模自然言語モデルであるBERTを用いて人間の解答傾向をシュミレートし、ジニ係数に基づいたGapスコアを算出することで問題を生成します。機械学習モデルは問題を解く際の人間の思考をシュミレートすることができるのか、そして機械学習モデルは良い問題を作ることができるのかを明らかにするために、研究を行っています。"
      },
      "relbot": {
        "title": "仲の良し悪しを判断しながら会話するロボット",
        "desc": "人は、会話の中で意見が合う合わないを考えながら、会話します。時には話し合いの中で仲間割れが生じます。本研究は、大規模言語モデルで会話参加者の関係を推測させながら、ハイダーのバランス理論と呼ばれる三人の間の好き嫌いの関係の変化規則を利用することで、仲間になったり、仲間割れが発生する会話を実現しています。慶應ファンのペッパーくんと、早稲田ファンのペッパーちゃんと、人間の三人の会話を見てみましょう。"
      },
      "travot": {
        "title": "対話を通じた旅行体験記生成",
        "desc": "ロボットとの対話を通じて旅行体験記を生成するシステムの実現を目指しています。画像キャプショニングが登場し、画像に関する説明文が得られるようになっていますが、その写真をとった時のエピソードや、体験したことなどの思い出は、画像情報から得られません。旅行体験記を作るためには、本人から情報を聞き出す必要があります。本研究では、旅行で撮った写真に対して人と会話するロボットを実現しました。そして、ロボットとの会話を通して得られた情報をもとに、思い出話の詰まった旅行体験記を生成することができます。"
      }
    },
    "themes": {
      "ai": {
        "title": "文脈を考慮した言語対話研究",
        "desc": "単語の意味は文脈で決まります。文脈は、意味が決まった単語で構成されます。双方が相手の構成要素となっているので、同時に推定していく手法が必要になります。このテーマでは、お互いが勘違いしながらも、徐々に対話の中で相手の言わんとしていることを理解していく時間進展のある言語理解アルゴリズムを開発しています。"
      },
      "si": {
        "title": "状況・画像と言語",
        "desc": "時に、人の発言は周囲の物や出来事に関連していて、自明な事柄は初略されます。また、周囲にある沢山の物のどれを無視して、どれに注目したらいいのかも、対話の文脈が進む中で決まってきます。このテーマでは、画像情報やセンサ情報の中から対話に重要な情報を決めていく手法の研究も行っています。"
      },
      "ad": {
        "title": "オーギュメンテッド対話：人のインタラクションの支援",
        "desc": "人と人のコミュニケーションで難しいのは、対話の中で相手が自分が言いたいことの意味を正しく理解しているのか、自分が示したい資料を見ているか本当のところは分からないことです。このテーマでは、対話分析する人工知能でやりとりの中で生じる欠けた情報を推測することで人と人の対話を支援するオーギュメンテッド対話を実現しようとしています。"
      },
      "iu": {
        "title": "少数サンプルと他者理解",
        "desc": "機械学習をするためには大量のデータが必要ですが、人は少ないサンプルでも理解できてしまうことが多々あります。本研究では、機械学習の特性と、人との情報集約の特性を比較しながら、人が他人から情報を聞き出す他者理解のインタラクションの場面に適応可能な新しいアルゴリズムの研究をしています。"
      },
      "ui": {
        "title": "人と相互適応するユーザインタフェース",
        "desc": "モバイルアプリケーション、ゲーム、テレプレゼンスロボット、自律走行車など、自動的に動きつつも人が操作する物が沢山存在します。本当は、人それぞれ別の操作方法が良いのにもかかわらず、事前にデザインされた操作インタフェースが提供されている物がほとんどです。このテーマでは、人が機械に慣れていく過程と、機械が人の特性を学習していく過程を相互適応として捉えて、より使いやすい知的な操作環境を提供することを目指しています。",
        "desc2": "TEROOSという名前のウェアラブルなアバターを研究しています。TEROOSは人の肩に装着され、着用者とそれを制御するユーザーが遠隔で視覚を共有できるようにします。さらに、このアバターには人間らしい顔があり、それを制御するユーザーが着用者と同じ場所にいる人々とコミュニケーションを取ることを可能にし人とロボットの共同活動を強化します。"
      },
      "ag": {
        "title": "マイグレートエージェント (ITACOシステム）",
        "desc": "人と対話形式で生活支援をするエージェントの研究をしています。ソフトウェアエージェントは、ロボットと異なり、様々な機器に移動しでサービスできるなどより柔軟な支援の提供が期待できます。本研究では、生活環境・家電機器のサービスをエージェントで統一的に扱えるユーザインタフェースの構築を目指し研究しています。"
      }
    },
    "keywords": {
      "ca": "認知適応",
      "as": "拡張社会",
      "cn": "認知神経ネットワーク"
    }
  },
  "access": {
    "location_exp": "今井研究室は矢上キャンパスにあります。\n見学は26-203へどうぞ。",
    "address": "〒223-8522\n神奈川県横浜市港北区日吉 3-14-1\n慶應義塾大学理工学部情報工学科 今井研究室",
    "rooms": "今井倫太 教授 居室: 26-208B\n学生居室: 26-203\n",
    "tel": "TEL: 045-566-1515 (教授居室)\nTEL: 045-566-1749 (学生居室)\n",
    "accessmap_link": "交通アクセス"
  },
  "for_collaborations": {
    "about": {
      "title": "慶應義塾大学今井研究室では、企業のみなさまの学術的な活動を支援するための学術コンサルティングや、企業のみなさまが持つ課題を一緒に解決していく共同研究などを積極的に受け入れいています。"
    },
    "examples": {
      "title": "共同研究の一例",
      "desc": "人とコミュニケーション(会話)するコンピュータシステム、CGエージェント、ロボットを利用したサービスシステムの構築。\n感情を持ったCGキャラクタ・ロボットのシステムデザイン\nオンライン会議システムの負荷価値サービスの構築\n大規模言語モデルを利用したシステム構築\nコミュニケーション（会話）データの分析"
    },
    "contact": {
      "title": "問い合わせ先",
      "desc": "慶應義塾大学　理工学部　教授　今井　倫太\n\nEmail: michita@ailab.ics.keio.ac.jp"
    }
  },
  "footer": {
    "quick_links": "クイックリンク",
    "contact": "連絡先",
    "copyright": "今井倫太研究室・慶應義塾大学理工学部情報工学科"
  }
}
